# Дан массив [1, 10, 20, 50, 3, 7, 5, 6, 8], вывести только те элементы, которые меньше 5
x = [1, 10, 20, 50, 3, 7, 5, 6, 8]
y = []
for i in x:
    if i < 5:
        y.append(i)
print(y)
